package homework_3;

public class Homework_3 {
	public static void main(String[] args) {
//		### Задания
//
//		1. **Идентификаторы и ключевые слова в Java:**
//		   - Объясните, что такое идентификаторы в языке программирования Java и какие правила их использования.
//		   - Какие слова в Java являются ключевыми и не могут использоваться в качестве идентификаторов?
//				
				
		
//		2. **Переменные и типизация:**
//		   - Изучите основные типы данных в Java (целочисленные, числовые с плавающей точкой, символьные, строковые).
//		   - Приведите примеры создания переменных различных типов данных.
//
//		3. **Создание и использование переменных:**
//		   - Каков синтаксис создания переменных в Java?
//		   - Каким образом присваиваются значения переменным в Java?
//
//		4. **Правила именования переменных:**
//		   - Какие правила следует соблюдать при именовании переменных в Java?
//		   - Приведите примеры правильного и неправильного именования переменных.
//
//		5. **Type Inference в Java:**
//		   - Что такое Type Inference в Java и в каких версиях языка оно поддерживается?
//		   - Приведите пример использования Type Inference.
//
//		6. **Целочисленные переменные и операции:**
//		   - Опишите различные целочисленные типы данных в Java.
//		   - Какие операции можно выполнять с целочисленными переменными?
//
//		7. **Создание случайных чисел и использование final:**
//		   - Как создать случайное число в Java с использованием класса Math?
//		   - Как объявить и использовать переменную с ключевым словом `final`?
//
//		8. **Операторы в Java:**
//		   - В чем заключается понятие операторов в языке программирования Java?
//		   - Какие категории операторов существуют?
//
//		9. **Менеджмент памяти и мнемоники в Java:**
//		   - Объясните, как в Java управляется память с помощью Garbage Collection.
//		   - Что такое мнемоники и как они связаны с управлением памятью?
//
//		10. **Приоритет операторов:**
//		    - Как определяется приоритет операторов в Java?
//		    - Почему важно знать порядок выполнения операций?
//
//		11. **Битовые операторы в Java:**
//		    - Какие битовые операторы поддерживаются в Java?
//		    - Приведите примеры использования битовых операторов.
//
//		12. **Тернарный оператор в Java:**
//		    - Как работает тернарный оператор в Java?
//		    - В чем отличие тернарного оператора от оператора if-else?
//
//		13. **Условные и логические операторы:**
//		    - Что такое условные (шаблонные) и логические операторы в Java?
//		    - Как они применяются в контексте управления потоком программы?
//
//		14. **Операторы присваивания и их разновидности:**
//		    - Какие операторы присваивания существуют в Java?
//		    - Как они используются для изменения значений переменных?
//
//		15. **Операторы отношения и сравнения:**
//		    - Какие операторы сравнения существуют в Java?
//		    - В чем разница между операторами отношения и логическими операторами?
//	}
}
