package homework_3;

public class Homework_3 {
	public static void main(String[] args) {
//		### Задания по Теме "Java Arrays"

//1. **Введение в Java Arrays:**
//   - Объясните, какие задачи решает класс Arrays в языке программирования Java.
//   - Почему использование класса Arrays может быть полезным при работе с массивами?
//
//2. **Метод Arrays.copyOf():**
//   - Напишите программу, используя метод `copyOf()`, для увеличения размера массива целых чисел и заполнения новых элементов нулями.
//   - Как изменится поведение, если вместо нулей указать другое значение?
//
//3. **Метод Arrays.copyOfRange():**
//   - Создайте программу, в которой используется метод `copyOfRange()` для создания подмассива из середины другого массива.
//   - Объясните, как изменится результат при изменении диапазона копирования.
//
//4. **Метод Arrays.toString():**
//   - Напишите программу, в которой массив строк преобразуется в строку с использованием метода `toString()`.
//   - Как вы думаете, почему это может быть полезным?
//
//5. **Метод Arrays.fill():**
//   - Разработайте программу, использующую метод `fill()`, чтобы заполнить массив символов определенным символом.
//   - Как изменится результат, если использовать другой символ?
//
//6. **Метод Arrays.binarySearch():**
//   - Создайте отсортированный массив целых чисел и реализуйте программу для поиска определенного значения с использованием метода `binarySearch()`.
//   - В чем преимущества бинарного поиска по сравнению с обычным?
//
//7. **Метод Arrays.equals():**
//   - Напишите программу, сравнивающую два массива строк на предмет их равенства с использованием метода `equals()`.
//   - Почему использование этого метода важно при сравнении массивов?
//
//8. **Проверка Наличия Элемента в Массиве:**
//   - Реализуйте программу, которая проверяет наличие определенного элемента в массиве строк с использованием методов `asList()` и `contains()` из класса Arrays.
//   - В чем заключается преимущество использования этого метода для поиска?
//
//9. **Массивы и Клонирование:**
//   - Напишите программу, использующую метод `clone()`, для создания копии массива целых чисел.
//   - Какие альтернативные способы клонирования массива вы можете предложить?
		
	}
}
